---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MechanicalSystem.DuctNetwork
source: html/93b81f99-e92e-d6ab-f459-eeb71717e809.htm
---
# Autodesk.Revit.DB.Mechanical.MechanicalSystem.DuctNetwork Property

The ducts and fittings contained within the system.

## Syntax (C#)
```csharp
public ElementSet DuctNetwork { get; }
```

## Remarks
The return value doesn't include terminals or equipments, the ducts and fittings are returned in no particular order.